{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "units": 128}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "units": 10}}]}